# -*- ii: ii; -*-
#+TITLE: Open broadcast studio setup
#+AUTHOR: James Blair
#+EMAIL: mail@jamesblair.net
#+DATE: 25th January 2022


I use [[https://obsproject.com][Open Broadcast Studio]] in Linux Mint to manage my audio and video devices for virtual meetings which drastically improves my video and audio quality. This page documents how I set up and the configuration I use.

Note: For audio hardware I generally rely on [[https://www.bluemic.com/en-us/products/yeti-nano/][Blue Yeti Nano]] microphones and [[https://electronics.sony.com/audio/headphones/headband/p/wh1000xm4-b][Sony WH-1000XM]] bluetooth headphones.


* Setup virtual audio devices

To control improve the quality of our audio we use a virtual audio output device, this allows us to take raw audio input from a microphone, apply filters and enhancements in obs, then output the enhanced audio to the virtual meeting software as a virtual microphone.

#+NAME: Create virtual audio devices
#+begin_src tmate
# Create the virtual speaker
pactl load-module module-null-sink sink_name=Source sink_properties=device.description=VirtualSpeaker

# Create the virtual microphone
pactl load-module module-virtual-source source_name=VirtualMic master=Source.monitor source_properties=device.description=VirtualMic
#+end_src


The code snippet above sets up virtual audio devices for our current session only with ~pactl~, if we restart our machine or session those devices will no longer exist.

To make it permanent we need to save the configuration to a file in our home directory.

#+NAME: Save virtual audio device configuration
#+begin_src tmate
# Ensure required directory exists
mkdir --parents ~/.config/pulse

# Create configuration file
echo ".include /etc/pulse/default.pa" > ~/.config/pulse/default.pa
echo "load-module module-null-sink sink_name=Source sink_properties=device.description=VirtualSpeaker" >> ~/.config/pulse/default.pa
echo "load-module module-virtual-source source_name=VirtualMic master=Source.monitor source_properties=device.description=VirtualMic" >> ~/.config/pulse/default.pa
#+end_src


If all devices created successfully you should see them listed after running the code block below:

#+NAME: Check virtual audio devices
#+begin_src shell
pacmd list-modules | grep -i "VirtualSpeaker"
pacmd list-modules | grep -i "VirtualMic"
#+end_src

#+RESULTS: Check virtual audio devices
#+begin_example
	argument: <sink_name=Source sink_properties=device.description=VirtualSpeaker>
	argument: <source_name=VirtualMic master=Source.monitor source_properties=device.description=VirtualMic>
#+end_example


